---
kind: type
id: T:Autodesk.Revit.DB.FamilyTypeSetIterator
source: html/0734d931-a9dc-6998-ce13-e5bce6f1a5b0.htm
---
# Autodesk.Revit.DB.FamilyTypeSetIterator

An iterator to a FamilyType set.

## Syntax (C#)
```csharp
public abstract class FamilyTypeSetIterator : APIObject,
	IEnumerator
```